# 04 Pemilihan kolom (columns selection) pada Data Frame berdasarkan tipe data

2273033 - Casyel Bersheba Limpele

Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)

2.0.3

Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df

   bil_pecahan  bil_bulat
0         15.0          7
1         12.0          4
2         14.0         17
3         14.0         11
4         10.0          3

In [3]:
df.index = pd.date_range(start='2023-10-01', periods=n_rows, freq='H')

df = df.reset_index()

df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2023-10-01 00:00:00         15.0          7    A
1 2023-10-01 01:00:00         12.0          4    B
2 2023-10-01 02:00:00         14.0         17    C
3 2023-10-01 03:00:00         14.0         11    D
4 2023-10-01 04:00:00         10.0          3    E

In [4]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

Memilih kolom bertipe data numerik

In [5]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         15.0          7
1         12.0          4
2         14.0         17
3         14.0         11
4         10.0          3

In [6]:
df.select_dtypes(include='float')

   bil_pecahan
0         15.0
1         12.0
2         14.0
3         14.0
4         10.0

In [7]:
df.select_dtypes(include='int')

   bil_bulat
0          7
1          4
2         17
3         11
4          3

Memilih kolom bertipe data string atau object

In [8]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

Memilih kolom bertipe data datetime

In [9]:
df.select_dtypes(include='datetime')

                index
0 2023-10-01 00:00:00
1 2023-10-01 01:00:00
2 2023-10-01 02:00:00
3 2023-10-01 03:00:00
4 2023-10-01 04:00:00

Memilih kolom dengan kombinasi tipe data

In [10]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         15.0          7    A
1         12.0          4    B
2         14.0         17    C
3         14.0         11    D
4         10.0          3    E